//
//  Answer.swift
//  Blueming
//
//  Created by 이나경 on 2023/10/02.
//

import Foundation

struct Answer {
    let answer: [String]!
    let point: [Int]!
}

extension Answer {
    static var data = [
        Answer(answer: ["산후 전과 동일해요.", "산후 전보다 조금 줄었어요.", "확실히 산후 전보다 많이 줄었어요.", "전혀 그러지 않았어요."], point: [0, 1, 2, 3]),
        Answer(answer: ["산후 전과 동일해요.", "산후 전보다 조금 줄었어요.", "확실히 산후 전보다 많이 줄었어요.", "전혀 그러지 않았어요."], point: [0, 1, 2, 3]),
        Answer(answer: ["전혀 그러지 않았어요.", "자주 그러지 않았어요.", "가끔 그랬어요.", "대부분 그랬어요."], point: [0, 1, 2, 3]),
        Answer(answer: ["전혀 그러지 않았어요.", "자주 그러지 않았어요.", "가끔 그랬어요.", "대부분 그랬어요."], point: [0, 1, 2, 3]),
        Answer(answer: ["전혀 그러지 않았어요.", "자주 그러지 않았어요.", "가끔 그랬어요.", "대부분 그랬어요."], point: [0, 1, 2, 3]),
        Answer(answer: ["그러지 않았고,\n평소와 다름 없이 일을 잘 처리했어요.", "그러지 않았고,\n대개는 일을 잘 처리했어요.", "가끔 그랬고,\n평소보다 일을 처리하기 힘들었어요.", "대부분 그랬고,\n일을 전혀 처리할 수 없었어요."], point: [0, 1, 2, 3]),
        Answer(answer: ["전혀 그러지 않았어요.", "자주 그러지 않았어요.", "가끔 그랬어요.", "대부분 그랬어요."], point: [0, 1, 2, 3]),
        Answer(answer: ["전혀 그러지 않았어요.", "자주 그러지 않았어요.", "가끔 그랬어요.", "대부분 그랬어요."], point: [0, 1, 2, 3]),
        Answer(answer: ["전혀 그러지 않았어요.", "자주 그러지 않았어요.", "가끔 그랬어요.", "대부분 그랬어요."], point: [0, 1, 2, 3]),
        Answer(answer: ["전혀 그러지 않았어요.", "자주 그러지 않았어요.", "가끔 그랬어요.", "대부분 그랬어요."], point: [0, 1, 2, 3])
    ]
}
